---
kind: method
id: M:Autodesk.Revit.DB.UV.#ctor(System.Double,System.Double)
source: html/2b40cc66-3513-169c-33e5-b68b3bce8ad0.htm
---
# Autodesk.Revit.DB.UV.#ctor Method

Creates a UV with the supplied coordinates.

## Syntax (C#)
```csharp
public UV(
	double u,
	double v
)
```

## Parameters
- **u** (`System.Double`) - The first coordinate.
- **v** (`System.Double`) - The second coordinate.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting an infinite number to the U or V property.